//змейка здесь https://yandex.ru/search/?text=%2Bjava+%D0%BD%D0%B0%D0%BF%D0%B8%D1%81%D0%B0%D1%82%D1%8C+%D0%B7%D0%BC%D0%B5%D0%B9%D0%BA%D1%83+%D0%BD%D0%B0+java&search_source=dzen_desktop_safe&src=suggest_Nin&lr=42
//правильно до мин __

package com.draft_task1_3_10;

//        Пример _ ППППППППППППППППППППППППППППППППППП
public class Draft_Task1_3_10_2 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                2. Напишите “змейку”. Есть поле 20х20, есть змейка длинной, пусть, 3
                квадрата. Выводится поле с положением змейки. Пользователь вводит, куда
                сделать следующий шаг - повернуть, или не двигаться. Рисуется поле с
                новым положением змейки.

                Решение:\s""");



    }
}

//        Конец Примера _ КККККККККККККККК






