public class Draft_Task1_3_9_0_Whole_Video {
    public static void main(String[] args) {
        //  Module1_Tema3_Urok9 Многомерные массивы.
        //  видео мин 05 23 - вывести 5 строк по 10 точек, номера столбцов, номера строк
        //  видео мин 16 33 - таблица умножения
        //  видео мин 21 32 - научиться ориентироваться во вложенных циклах
        //  видео мин 22 22 - таблица умножения с логарифмом
        //  видео мин 22 50 - отбросить дробную часть, int logCel = (int)log;
        //  видео мин 25 20 - первый раз пишет многомерный массив
        //  видео мин 30 43 - морской бой
        //  про пакеты здесь: https://www.youtube.com/watch?v=-iEG-0g6CQ0
        //  закончил видео мин 09 21


        }
}
