import java.io.IOException;
import java.text.ParseException;


//        Пример _ ППППППППППППППППППППППППППППППППППП
public class Draft_Task1_3_6_4 {
    public static void main(String[] args) throws IOException, ParseException {
        System.out.println("""
                Задание:\s
                4. Найдите последнее слово в массиве, которое написано ЗаБоРчИкОм (чтоб узнать, заглавная 
                ли буква, используйте Character.isUpperCase(letter))

                Решение:\s""");

    }
}
//        Конец Примера _ КККККККККККККККК









