public class Draft_Task1_3_9_1_Mnogomernye_massivy {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                8. Создайте матрицу char[][], проинициализируйте ее латинским алфавитом,
                   выведите его. Подсказка - можно получить первую букву как char ch = ‘a’,
                   следующую - как ch + 1, и так далее.
                    
                Решение:\s""");

    }
}
